# FamilyPath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyLoadingIntoDocumentEventArgs..::..FamilyPath Property
FamilyLoadingIntoDocumentEventArgs Class See Also
---
The file path of the family that is being loaded into the document.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string FamilyPath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyPath As String
	Get
```

Visual C++
---
```text
public:
property String^ FamilyPath {
	String^ get ();
}
```

# See Also
FamilyLoadingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace